/*Написать предшественник программы, управляемой меню. Она должна отображать меню из четырех пунктов, каждый помечен буквой.
Если пользователь вводит букву, отличающуюся от допустимых - программа запрашивает ввод повторно до полуения одного из доспустимых вариантов.
Затем она должна выполнить некое простое действие на основе пользовательского выбора. Работа программы должна выглядеть примерно так:
Please enter the one following choices:
c) carnivore       p)pianist
t) tree            g) game
f
Please enter a c, p, t or g: q
Please enter a c, p, t or g: t
A maple is a tree.*/

#include <stdio.h>

int main(){
    
    char choice;
    char *c_art[] = {
        "        /\\_/\\",
        "   ____/ o o \\",
        " /~____  =ø= /",
        "(______)__m_m)"
    };

    char *p_art[] = {
        " _______________________________________",
        "|  | | | |  |  | | | | | |  |  | | | |  |",
        "|  | | | |  |  | | | | | |  |  | | | |  |",
        "|  | | | |  |  | | | | | |  |  | | | |  |",
        "|  |_| |_|  |  |_| |_| |_|  |  |_| |_|  |",
        "|   |   |   |   |   |   |   |   |   |   |",
        "|   |   |   |   |   |   |   |   |   |   |",
        "|___|___|___|___|___|___|___|___|___|___|"
    };

    char *t_art[] = {
        "  .-'- -.",
        " (       )",
        "(  ,      )",
        " ( \'./  .'",
        "  '-| |-'",
        "    | |",
        ",,,,|.|,,,"
    };

    char *g_art[] = {
        "$$$$$$$$$$$$$$$$\"\"$o$o$o$o$o$oo$$\"\"$$$$$$$$$$$$$$$",
        "$$$$$$$$$$$$\"\"o$$$$$$$$$$\"$\"$$$$$$$o$\"$$$$$$$$$$$$",
        "$$$$$$$$$\"$o$$$$\"\"$oo $ \"\"      \"\"\"$$$oo\"$$$$$$$$$",
        "$$$$$$$\"o$$$$\"   \"\"o  $oo o o       \"\"$$$o\"$$$$$$$",
        "$$$$$\"o$$$\"       oo$$$$$$$$$$o        \"$$$o\"$$$$$",
        "$$$$\"o$$$  $  o$$$$$$$$$$$$$$\"$$oo       \"$$$ $$$$",
        "$$$\"$$$\"   \"$$$$$$$$$$$$$$$$o$o$$$\"        $$$o$$$",
        "$$ $$$    o$$$$$$$$$$$$$$$$$$$$$$$$o o   o  \"$$o\"$",
        "$\"$$$\"    o$$$$$$$$$\"$$$$$$\"\" \"$$$$$$\"$$$$$  $$$\"$",
        "$o$$\"    o$$$$$$$$$$o\"\"$$$\"\"\"\"ooo\"$$$$$$$$\"   $$$\"",
        "$o$$\"    o$$$$$$$$$$            \"\"oo\"$\"$o\"\"   $$$o",
        "o$$$     o$$$$$$$$$$                \"\"\"\"\"$    o$$o",
        "o$$$    o$$$$$$$$$$$$o                   \"o \"oo$$o",
        "o$$$  oo$$$$$$$$$$$$$$$$ooooooo$$$$$oo    $\"$ \"$$o",
        "o$$$\"  \"\"  $$$$$$$$$$$$$$$$$$$$$$$$$$$$o    \"  $$$",
        "$ $$$       \"$$$$$$$$$$$$$$$$$$$$$$$$$$$o    o$$\"$",
        "$$\"$$o       \"$$$$$$$$$$$$$$$$$$$$$$$$$$$o   $$$o$",
        "$$o$$$o       $$\"\"$$$$$$$$$$$$$$$$$$$$$$$o  $$$ $$",
        "$$$o\"$$o    \"$\"\"  \"$\"\"$$$$$$$$$$$$$$$$$$$oo$$$\"$$$",
        "$$$$o\"$$$o        \"     $$$$$$$$$$$$$$$$$o$$\"o$$$$",
        "$$$$$$o\"$$$o         oo$$$$$$$$$$$$$$$$$$$$\"o$$$$$",
        "$$$$$$$$o\"$$$$ooooo$$$$$$$$$$$$$$$$$$$$$$\"o$$$$$$$",
        "$$$$$$$$$$o\"\"$$$$$$$$$$$$$$$$$$$$$$$$$\"oo$$$$$$$$$",
        "$$$$$$$$$$$$$o$\"\"$$$$$$$$$$$$$$$$$\"\"oo$$$$$$$$$$$$",
        "$$$$$$$$$$$$$$$$$$o$o$\"$\"$\"$\"$oo$o$$$$$$$$$$$$$$$$"
    };
    
    printf("Please enter the one following choices:\n c) carnivore \t p) pianist\n t) tree \t g) game\n");

    do
    {
        scanf(" %c",&choice);
        switch (choice)
        {
        case 'c':
            for(int i = 0; i < sizeof(c_art)/sizeof(c_art[0]); i++){
                printf("%s\n", c_art[i]);
            };
            break;

        case 'p':
            for(int i = 0; i < sizeof(p_art)/sizeof(p_art[0]); i++){
                printf("%s\n", p_art[i]);
            };
            break;

        case 't':
            for(int i = 0; i < sizeof(t_art)/sizeof(t_art[0]); i++){
                printf("%s\n", t_art[i]);
            };
            break;

        case 'g':
            for(int i = 0; i < sizeof(g_art)/sizeof(g_art[0]); i++){
                printf("%s\n", g_art[i]);
            };
            break;
       
        default:
            printf("Please enter a c, p, t or g: ");
            continue;
        }
        break;
    } while (1); 
    
    return 0;
}