/*Последовательность чисел назовём симметричной, если она одинаково читается как слева направо, так и справа налево.
Например, следующие последовательности являются симметричными:
1 2 3 4 5 4 3 2 1
1 2 1 2 2 1 2 1
Вашей программе будет дана последовательность чисел.
Требуется определить, какое минимальное количество и каких чисел надо приписать в конец этой последовательности, чтобы она стала симметричной.
Сначала вводится число N N — количество элементов исходной последовательности (1 ≤ ≤ N N ≤ ≤ 100).
Далее идут N N чисел — элементы этой последовательности, натуральные числа от 1 до 9.
Выведите сначала число M M — минимальное количество элементов, которое надо дописать к последовательности,
а потом M M чисел (каждое — от 1 до 9) — числа, которые надо дописать к последовательности.*/