/*Дан список, заполненный произвольными целыми числами. Найдите в этом списке два числа, произведение которых максимально.
Формат ввода:
В единственной строке через пробел вводятся целые числа — элементы списка. Список содержит не менее двух и не более 100 000 чисел.
Сами элементы по модулю не превышают 1 000 000.
Формат вывода:
Выведите эти два числа в порядке неубывания.
Примечание: Решение должно иметь сложность O ( n ) O(n), где n n — размер списка. Гарантируется, что во всех тестах ответ однозначен.*/